tutorials-pM4F/dbsFoam/flowOnly/constrictedTube/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication blockMesh
runApplication setFields

runApplication transformPoints scale='(1e-3 1e-3 1e-3)'

runApplication $application



#------------------------------------------------------------------------------
