tutorials-pM4F/dbsFoam/flowOnly/constrictedTube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; //e-6; //1e-5;

//(-0.195074 -0.00760215 -0.002) (0.178554 0.0108643 0.002)


/*
lx 588;
ly -218.2384;
lz  1;
*/

//(-0.090926 -0.0363603 -0.002) (0.0978846 0.0387419 0.002)

lx0 -0.194;
ly0 -0.01;
lz0 -0.001;

lx 0.177;
ly 0.013;
lz 0.001;



vertices        
(
    ($lx0 	$ly0 	$lz0)
    ($lx 	$ly0 	$lz0)
    ($lx 	$ly 	$lz0)
    ($lx0 	$ly 	$lz0)
    ($lx0 	$ly0 	$lz)
    ($lx 	$ly0 	$lz)
    ($lx 	$ly 	$lz)
    ($lx0 	$ly 	$lz)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7)  (1000 100 1) simpleGrading (1 1 1)  // (20 20 20) 
); // 1000 x 250

edges           
(
);

//patches  
boundary       
(

    right
	{
		type patch; //cyclic;
		faces
		(
        (2 6 5 1)
		);
//		neighbourPatch left;
	}

    left
	{
		type patch; //cyclic;
		faces
		(
        (0 4 7 3)
		);
//		neighbourPatch right;
	}

    bottom
	{
		type patch; //cyclic;
		faces
		(
        (1 5 4 0)
		);
//		neighbourPatch top;
	}

    top
	{
		type patch; //cyclic;
		faces
		(
         (3 7 6 2)
		);
//		neighbourPatch bottom;
	}

    frontAndBack
	{
		type empty;
		faces
		(
        (0 3 2 1)
        (4 5 6 7)
		);
	}

);

mergePatchPairs 
(
);


// ************************************************************************* //
